In [13]:
import pandas as pd
import numpy as np

## Operações com DataFrames

In [2]:
Quadro_Medalhas_Rio_2016 = {
    'USA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Britain':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Russe':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Germany':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [4]:
#Criação do dataframe com Pandas utilizando from_dict
Rio_2016 = pd.DataFrame.from_dict(Quadro_Medalhas_Rio_2016)

In [14]:
Rio_2016

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [7]:
#Metodos para pegar apenas um dos paises
Medalhas_China = Rio_2016['China'] ;Medalhas_China

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [8]:
Rio_2016.Russe

Ouro      19
Prata     18
Bronze    19
Name: Russe, dtype: int64

In [9]:
Rio_2016[['Russe', 'Germany']]

        Russe  Germany
Ouro       19       17
Prata      18       10
Bronze     19       15

In [10]:
Rio_2016.get('Germany')

Ouro      17
Prata     10
Bronze    15
Name: Germany, dtype: int64

In [15]:
Rio_2016

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [28]:
Rio_2016[:2]

       USA  China  Britain  Russe  Germany
Ouro    46     26       27     19       17
Prata   37     18       23     18       10

In [29]:
Rio_2016[2:]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15

In [30]:
Rio_2016[::-1]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15
Prata    37     18       23     18       10
Ouro     46     26       27     19       17

In [31]:
#Slicing por indexação

In [32]:
#Valor melhadas de ouro tiradas pelos paises
Rio_2016.loc['Ouro']

USA        46
China      26
Britain    27
Russe      19
Germany    17
Name: Ouro, dtype: int64

In [34]:
#Retorna todas as linhas para a coluna USA
Rio_2016.loc[:,'USA']

Ouro      46
Prata     37
Bronze    38
Name: USA, dtype: int64

In [35]:
#retornar valores especificos
Rio_2016.loc['Prata', 'China']

18

In [46]:
Rio_2016.loc['Prata']

USA        37
China      18
Britain    23
Russe      18
Germany    10
Name: Prata, dtype: int64

In [40]:
#retornar valores em formato Bool caso medalhas ouro sejam maior que 20
Rio_2016.loc['Ouro'] > 20

USA         True
China       True
Britain     True
Russe      False
Germany    False
Name: Ouro, dtype: bool

In [44]:
#retornar paises que contem mais de 20 medalhas de ouro
Rio_2016.loc[:,Rio_2016.loc['Ouro'] > 20]

        USA  China  Britain
Ouro     46     26       27
Prata    37     18       23
Bronze   38     26       17

In [48]:
Rio_2016.loc['Prata'] > 20

USA         True
China      False
Britain     True
Russe      False
Germany    False
Name: Prata, dtype: bool

In [51]:
#paises com medalhas de prata acima de 20
Rio_2016.loc[:,Rio_2016.loc['Prata'] > 20]

        USA  Britain
Ouro     46       27
Prata    37       23
Bronze   38       17

In [52]:
#retorna os valores até linha indice 2 retornando apenas 0 e , 1
Rio_2016.iloc[:2]

       USA  China  Britain  Russe  Germany
Ouro    46     26       27     19       17
Prata   37     18       23     18       10

In [53]:
#retorna apenas a linha indice 2 em diante
Rio_2016.iloc[2:]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15

In [57]:
Rio_2016.iloc[2,0:2]

USA      38
China    26
Name: Bronze, dtype: int64

In [58]:
#retornando linha 2 (bronze) a partir do indice 0(USA) até indice 1(china) pois 2 não retorna
Rio_2016

        USA  China  Britain  Russe  Germany
Ouro     46     26       27     19       17
Prata    37     18       23     18       10
Bronze   38     26       17     19       15

In [60]:
#Remover dados
del Rio_2016['USA']

In [61]:
Rio_2016

        China  Britain  Russe  Germany
Ouro       26       27     19       17
Prata      18       23     18       10
Bronze     26       17     19       15

In [62]:
#Descrição dos dados
Rio_2016.describe()

           China    Britain      Russe    Germany
count   3.000000   3.000000   3.000000   3.000000
mean   23.333333  22.333333  18.666667  14.000000
std     4.618802   5.033223   0.577350   3.605551
min    18.000000  17.000000  18.000000  10.000000
25%    22.000000  20.000000  18.500000  12.500000
50%    26.000000  23.000000  19.000000  15.000000
75%    26.000000  25.000000  19.000000  16.000000
max    26.000000  27.000000  19.000000  17.000000